# Quiz: Python for Data Analysts

In [67]:
import pandas as pd

## Data Pre-Processing

The data you will read in is `companies.csv`, a small sample of a a larger CRM (customer relationship management) dataset.

In [68]:
clients = pd.read_csv("data/companies.csv", index_col=0)
clients.head()

,Customer Name,Consulting Sales,Software Sales,Forecasted Growth,Returns,Month,Day,Year,Location,Account
ID,,,,,,,,,,
30940,New Media Group,IDR7125000,IDR5500000,30.00%,"IDR1,500,000",1,10,2017,Jakarta,Enterprise
82391,Li and Partners,IDR420000,IDR820000,10.00%,"IDR400,000",6,15,2016,Jakarta,Startup
18374,PT. Kreasi Metrik Solusi,0,IDR550403,25.00%,0,3,29,2012,Surabaya,Enterprise
57531,PT. Algoritma Data Indonesia,IDR850000,IDR395500,4.00%,0,7,17,2017,Jakarta,Startup
19002,Palembang Konsultansi,IDR2115000,0,-15.00%,0,2,24,2018,Bandung,Startup

Unlike our previous datasets, `clients` has some formatting inconsistencies by design: The `Returns` column has comma delimiter and the currency (`IDR`) whereas related columns use values that has omitted the separator.

Now let's observe its data types:

In [79]:
clients.dtypes

Customer Name        object
Consulting Sales      int32
Software Sales        int32
Forecasted Growth    object
Returns              object
Month                 int64
Day                   int64
Year                  int64
Location             object
Account              object
dtype: object

Do you think they have stored as the right types? Can you apply what you have learnt about specifying data type on this new data?

In [78]:
## Your Code Below:
clients['Consulting Sales'] = clients['Consulting Sales'].astype('int')
#clients['Software Sales'] = clients['Software Sales'].astype('int')


#df[["a", "b"]] = df[["a", "b"]].apply(pd.to_numeric)

#clients[["","",""]] = clients[["Consulting Sales","Software Sales","Returns"]].astype('int')

If you tried to directly use the `.astype` function on `Consulting Sales` and `Software Sales`, you will most likely get an error.  To perform arithmetic computations on the numeric columns, we have to drop the 'IDR' currency string and treat these columns as numbers. We'll use pandas built-in `.str.replace()` method for this.

In [71]:
clients['Consulting Sales'].str.replace('IDR','')

ID
30940    7125000
82391     420000
18374          0
57531     850000
19002    2115000
31142     960000
Name: Consulting Sales, dtype: object

To apply the function on multiple columns, we can use `apply` method with `lambda` as below:

In [72]:
clients[['Consulting Sales','Software Sales','Returns']] =\
clients[['Consulting Sales','Software Sales','Returns']].apply(lambda x: x.str.replace('IDR',''))

In [65]:
clients.head()

,Customer Name,Consulting Sales,Software Sales,Forecasted Growth,Returns,Month,Day,Year,Location,Account
ID,,,,,,,,,,
30940,New Media Group,7125000,5500000,30.00%,"1,500,000",1,10,2017,Jakarta,Enterprise
82391,Li and Partners,420000,820000,10.00%,"400,000",6,15,2016,Jakarta,Startup
18374,PT. Kreasi Metrik Solusi,0,550403,25.00%,0,3,29,2012,Surabaya,Enterprise
57531,PT. Algoritma Data Indonesia,850000,395500,4.00%,0,7,17,2017,Jakarta,Startup
19002,Palembang Konsultansi,2115000,0,-15.00%,0,2,24,2018,Bandung,Startup

Go on fill in the blank below to remove the comma (`,`) sign on `Returns`!

In [73]:
## Fill in the blank (___):

#clients = 
clients['Returns'].str.replace(',','')

ID
30940    1500000
82391     400000
18374          0
57531          0
19002          0
31142          0
Name: Returns, dtype: object

---

1. Create a new column in the DataFrame and name it `Total Sales`. This column is a sum of `Consulting Sales` and `Software Sales`. Use `head` or `tail` to peek at the resulting data frame to confirm that the output matches your expectation. What is the sum of the `Total Sales` column?  

    *Anda diminta untuk mendapatkan total penjualan secara keseluruhan dengan mengakumulasikan nilai Consulting Sales dan Software Sales dari setiap perusahaan. Buatlah kolom baru bernama Total Sales yang menyimpan total dari kedua nilai tersebut. Berapa total (`sum`) keseluruhan dari `Total Sales`? Tips: Gunakan method `.sum()` pada kolom untuk mengakumulasi nilai totalnya!*

    - [ ] 11,470,000
    - [x] 19,238,903
    - [ ]  7,768,903

In [101]:
clients['Total Sales'] = clients['Consulting Sales'] + clients['Software Sales']
clients.tail()

,Customer Name,Consulting Sales,Software Sales,Forecasted Growth,Returns,Month,Day,Year,Location,Account,Total Sales
ID,,,,,,,,,,,
82391,Li and Partners,420000,820000,10.00%,"400,000",6,15,2016,Jakarta,Startup,1240000
18374,PT. Kreasi Metrik Solusi,0,550403,25.00%,0,3,29,2012,Surabaya,Enterprise,550403
57531,PT. Algoritma Data Indonesia,850000,395500,4.00%,0,7,17,2017,Jakarta,Startup,1245500
19002,Palembang Konsultansi,2115000,0,-15.00%,0,2,24,2018,Bandung,Startup,2115000
31142,PT. Surya Citra Manajemen,960000,503000,19.00%,0,1,19,2019,Jakarta,Enterprise,1463000

In [102]:
clients['Total Sales'].sum()

19238903

2. Which company has the biggest `Total Sales` in 2017?  

    *Perusahaan manakah yang mendapatkan Total Sales terbesar di tahun 2017? Gunakan metode subset yang telah Anda pelajari!*
    
    - [x] New Media Group
    - [ ] PT. Algoritma Data Indonesia
    - [ ] Palembang Konsultansi

In [123]:
clients[(clients['Year'] == 2017)].head(10)

,Customer Name,Consulting Sales,Software Sales,Forecasted Growth,Returns,Month,Day,Year,Location,Account,Total Sales
ID,,,,,,,,,,,
30940,New Media Group,7125000,5500000,30.00%,"1,500,000",1,10,2017,Jakarta,Enterprise,12625000
57531,PT. Algoritma Data Indonesia,850000,395500,4.00%,0,7,17,2017,Jakarta,Startup,1245500

3. Which are the two companies that has sales exceeding 1,500,000 IDR in the sampled data frame?  

    *Ada dua perusahaan yang nilai penjualannya melebihi 1,500,000 IDR pada data sample tersebut. Perusahaan mana sajakah itu?*

    - [ ] Palembang Konsultansi & PT. Surya Citra Manajemen
    - [ ] PT. Surya Citra Manajemen & New Media Group
    - [x] Palembang Konsultansi & New Media Group

In [109]:
#rice[rice.quantity >= 8].head()
#rice[(rice['format'] != 'minimarket')]
clients[(clients['Total Sales'] > 1500000)].head()

,Customer Name,Consulting Sales,Software Sales,Forecasted Growth,Returns,Month,Day,Year,Location,Account,Total Sales
ID,,,,,,,,,,,
30940,New Media Group,7125000,5500000,30.00%,"1,500,000",1,10,2017,Jakarta,Enterprise,12625000
19002,Palembang Konsultansi,2115000,0,-15.00%,0,2,24,2018,Bandung,Startup,2115000

4. The simplest way to ignore the outliers of sample data and find its central value is by using median instead of mean. By ignoring the outliers of `Total Sales`, what is its central value?  

    *Dalam menentukan rata-rata / pusat data, penggunaan median seringkali lebih relevan dibandingkan dengan mean, karena mean lebih mudah terpengaruh terhadap nilai-nilai ekstrim atau outlier. Jika kita tidak ingin mendapatkan pusat data yang terpengaruh outlier pada Total Sales, berapakah nilai pusat data yang kita gunakan?*
    
    - [ ] 1,354,250
    - [ ] 1,515,875
    - [ ] 3,737,700

5. If we want to perform subsetting on `clients` by explicitly stating the `ID`, which subsetting method is more appropriate?  

    *Jika kita ingin melakukan operasi subsetting pada data `clients` dimana dalam prosesnya kita mencantumkan ID perusahaan secara eksplisit, metode subsetting manakah yang paling sesuai?*

    - [x] `clients.loc[57531, :]`
    - [ ] `clients.iloc[57531, : ]` #seharusnya klau menggunakan iloc menyebut nama datanya.
    - [ ] `clients[57531, : ]` #tdk ada loc/ilocny

In [113]:
clients.loc[57531, :]

Customer Name        PT. Algoritma Data Indonesia
Consulting Sales                           850000
Software Sales                             395500
Forecasted Growth                           4.00%
Returns                                         0
Month                                           7
Day                                            17
Year                                         2017
Location                                  Jakarta
Account                                   Startup
Total Sales                               1245500
Name: 57531, dtype: object

6. Say, we need to find clients of Enterprise account which specifically located in Jakarta. Try to fill in the blank codes to perform the right conditional subsetting:  `clients[________ _ ________]`:

    *Apabila kita ingin mendapatkan data dari client dengan akun Enterprise yang berlokasi di Jakarta, syntax subset yang akan kita gunakan adalah clients[________ _ ________]. (Isilah nilai di dalam kurung siku!)*

    - [ ] (clients.Location == "Jakarta") | (clients.Account == "Enterprise") # atau / salah satu
    - [ ] clients.Location == "Jakarta" & clients.Account == "Enterprise"
    - [x] (clients.Location == "Jakarta") & (clients.Account == "Enterprise")
    - [ ] clients.Location == "Jakarta" | clients.Account == "Enterprise"

In [115]:
(clients.Location == "Jakarta") & (clients.Account == "Enterprise")

ID
30940     True
82391    False
18374    False
57531    False
19002    False
31142     True
dtype: bool